{
  "_name_or_path": "DeepPavlov/rubert-base-cased-sentence",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "A",
    "1": "BB",
    "2": "AAA",
    "3": "BBB",
    "4": "AA+",
    "5": "BB+",
    "6": "BB-",
    "7": "A-",
    "8": "A+",
    "9": "B",
    "10": "AA-",
    "11": "BBB+",
    "12": "BBB-",
    "13": "B-",
    "14": "AA",
    "15": "B+",
    "16": "C"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "A":0,
    "BB":1,
    "AAA":2,
    "BBB":3,
    "AA+":4,
    "BB+":5,
    "BB-":6,
    "A-":7,
    "A+":8,
    "B":9,
    "AA-":10,
    "BBB+":11,
    "BBB-":12,
    "B-":13,
    "AA":14,
    "B+":15,
    "C":16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.33.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
